---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShape.StirrupTieAttachment
source: html/5e8deedb-9319-b087-a573-03c9ad996f2c.htm
---
# Autodesk.Revit.DB.Structure.RebarShape.StirrupTieAttachment Property

The attachment type of stirrup ties and rebars.

## Syntax (C#)
```csharp
public StirrupTieAttachmentType StirrupTieAttachment { get; }
```